       IDENTIFICATION DIVISION.
       PROGRAM-ID. LAB5.
       AUTHOR. MARIO GARCIA.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INPUT-FILE   ASSIGN TO 'DA-S-INPUT'
                   ORGANIZATION IS LINE SEQUENTIAL.
           SELECT PRNT-FILE    ASSIGN TO 'UR-S-PRNT'
                   ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.

       FILE SECTION.
       FD  INPUT-FILE.
       01 INPUT-REC.
        88 EOF VALUE HIGH-VALUES.
        02 EMP-NAME PIC X(20).
        02 EMP-DEGREE PIC X(4).
        02 EMP-YEAR PIC 9(4).
        02 LOAN-AMT PIC 9(5)V99.
        02 LOAN-PAYMENTS OCCURS 4 TIMES PIC 9(4)V99.
        02 FILLER PIC X(21) VALUE SPACES.

       FD PRNT-FILE.
       01 PRNT-REC PIC X(200).

       WORKING-STORAGE SECTION.

       01 MISCL.
        03 LINE-CT PIC 99 VALUE 0.
        03 SUB        PIC 9(2).

       01 PRNT-HEADING.
        02 FILLER PIC X(4) VALUE "NAME".
        02 FILLER PIC X(17) VALUE SPACES.
        02 FILLER PIC X(6) VALUE "DEGREE".
        02 FILLER PIC X(4) VALUE SPACES.
        02 FILLER PIC X(4) VALUES "YEAR".
        02 FILLER PIC X(3) VALUE SPACES.
        02 FILLER PIC X(4) VALUE "LOAN".
        02 FILLER PIC X(7) VALUE SPACES.
        02 FILLER PIC X(24) VALUE "PAID    ----------------".
        02 FILLER PIC X(15) VALUE "---------------".
      * 02 FILLER PIC X(5) VALUE SPACES.

       01 PRNT-DATA.
        02 PRN-EMP-NAME PIC X(20).
        02 FILLER PIC X VALUE SPACES.
        02 PRN-EMP-DEGREE PIC X(4).
        02 FILLER PIC X(6) VALUE SPACES.
        02 PRN-EMP-YEAR PIC ZZZ9.
        02 FILLER PIC X(3) VALUE SPACES.
        02 PRN-LOAN-AMT PIC ZZZZ9.99.
        02 FILLER PIC X(3) VALUE SPACES.
        02 PRN-LOAN-PAYMENT-1 PIC ZZZ9.99.

       01 PRNT-DATA-1.
        02 FILLER PIC X(49) VALUE SPACES.
        02 PRN-LOAN-PAYMENT PIC ZZZ9.99.

       01 PRNT-DATA-2.
        02 FILLER PIC X(34) VALUE SPACES.
        02 FILLER PIC X(12) VALUE "TOTAL PAID  ".
        02 PRN-TOT-PAID PIC $$$,$$9.99.
        02 BALANCE-MSG PIC X(18).
        02 PRN-BALANCE PIC $$$,$$9.99.
        02 PRN-OVERFLOW-FLAG PIC XXX.

       01 PRNT-CALCULATIONS.
        02 TOT-PAID PIC 9(7).
        02 BALANCE PIC 9(7).

       PROCEDURE DIVISION.
       MAIN.
       OPEN INPUT INPUT-FILE
       OUTPUT PRNT-FILE.
       READ INPUT-FILE INTO INPUT-REC
               AT END SET EOF TO TRUE
               END-READ
       PERFORM PRINT-HEADING
       PERFORM UNTIL EOF
          PERFORM PRINT-INFORMATION
          READ INPUT-FILE INTO INPUT-REC
            AT END SET EOF TO TRUE
          END-READ
       END-PERFORM
       CLOSE INPUT-FILE, PRNT-FILE
       STOP RUN.

        PRINT-HEADING.
           MOVE SPACES TO PRNT-REC.
           WRITE PRNT-REC AFTER ADVANCING PAGE

           WRITE PRNT-REC FROM PRNT-HEADING
           AFTER ADVANCING 3 LINES
           MOVE SPACES TO PRNT-REC
           WRITE PRNT-REC AFTER ADVANCING 1 LINES
           MOVE 0 TO LINE-CT.

       PRINT-INFORMATION.
           IF LINE-CT > 7 THEN
                PERFORM PRINT-HEADING
           END-IF.
          MOVE EMP-NAME TO PRN-EMP-NAME
          MOVE EMP-DEGREE TO PRN-EMP-DEGREE
          MOVE EMP-YEAR TO PRN-EMP-YEAR
          MOVE LOAN-AMT TO PRN-LOAN-AMT
          MOVE LOAN-PAYMENTS(1) TO PRN-LOAN-PAYMENT-1
          WRITE PRNT-REC FROM PRNT-DATA
          AFTER ADVANCING 1 LINES

          PERFORM VARYING SUB FROM 2 BY 1
                UNTIL SUB > 4
                MOVE LOAN-PAYMENTS(SUB) TO PRN-LOAN-PAYMENT
                WRITE PRNT-REC FROM PRNT-DATA-1
                AFTER ADVANCING 1 LINE
          END-PERFORM

          MOVE ZERO TO TOT-PAID
          PERFORM VARYING SUB FROM 1 BY 1
                UNTIL SUB > 4
                COMPUTE TOT-PAID = TOT-PAID +  LOAN-PAYMENTS(SUB)
          END-PERFORM

          PERFORM CALC-TOT-AND-BAL
          MOVE TOT-PAID TO PRN-TOT-PAID
          MOVE BALANCE TO PRN-BALANCE

          WRITE PRNT-REC FROM PRNT-DATA-2
          AFTER ADVANCING 2 LINES
          ADD 1 to LINE-CT
          MOVE SPACES TO PRNT-REC

          WRITE PRNT-REC AFTER ADVANCING 2 LINES
           MOVE SPACES TO PRN-OVERFLOW-FLAG.
       CALC-TOT-AND-BAL.
         IF TOT-PAID < LOAN-AMT OR = LOAN-AMT THEN
                 MOVE "       BALANCE    " TO BALANCE-MSG
           ELSE
                 MOVE " OVERPAID BALANCE " TO BALANCE-MSG
                MOVE "-**" TO PRN-OVERFLOW-FLAG
         END-IF

         COMPUTE BALANCE = LOAN-AMT - TOT-PAID.
